{
    "navItems": {
        "workexperience": "Berufserfahrung",
        "projects": "Projekte"
    },
    "profile": {
        "introduction": {
            "firstLine": "Hey, ich bin Joel.",
            "secondLine": "Ich bin ein Fullstack",
            "thirdLine": "Software Entwickler."
        },
        "badges": {
            "location": "Görlitz, Sachsen, Deutschland",
            "age": "Jahre",
            "languages": {
                "de": "Deutsch (Muttersprache)",
                "en": "Englisch (fließend)"
            }
        },
        "techstack": {
            "java": "Programmiersprache",
            "mongodb": "Datenbank",
            "docker": "Containerisierung",
            "git": "Versionsverwaltung",
            "typescript": "Programmiersprache",
            "react": "Javascript Bibliothek"
        }
    },
    "discord": {
        "activity": {
            "since": "seit"
        }
    },
    "workexperience": {
        "title": "Berufserfahrung",
        "badge": {
            "current": "Aktuell"
        },
        "3": {
            "title": "Praktikant im Online Marketing",
            "location": "Görlitz, Sachsen, Deutschland",
            "startDate": "25. August, 2025",
            "endDate": "Heute",
            "description": "LiberTec ist eine Full-Service Online-Marketing-Agentur, die Unternehmen bei Ads, Content, Webentwicklung und Design unterstützt. Während meines Praktikums arbeite ich in verschiedenen Bereichen mit, unter anderem bei Video-Schnitt, Animationen, Ads und der Gestaltung von Designs. So bekomme ich einen guten Einblick in die vielseitigen Aufgaben einer Marketing-Agentur."
        },
        "2": {
            "title": "Praktikant in der Softwareentwicklung",
            "location": "Görlitz, Sachsen, Deutschland",
            "startDate": "11. März, 2024",
            "endDate": "22. März, 2024",
            "description": "Entwicklung einer prototypischen Webapplikation mit React, Next.js und Tailwind. Umsetzung eines Showcases für ein Schieberegister mit dem Calliope Mini. Backend-Entwicklung in Java mit Javalin. Fundierte Kenntnisse in der seriellen zu parallelen Datenumwandlung am \"74HC595\" Schieberegister."
        },
        "1": {
            "title": "Praktikant in der Softwareentwicklung",
            "location": "Görlitz, Sachsen, Deutschland",
            "startDate": "12. Juni, 2023",
            "endDate": "16. Juni, 2023",
            "description": "Erstellung eines GTA für den Calliope Mini mit JavaScript unter Einhaltung von Codestyle-Richtlinien. Verfassen eines Projektsteckbriefs und Evaluierung einer REST API mit Kotlin.",
            "codeStyle": "Code Strukturierung"
        }
    },
    "projects": {
        "title": "Projekte",
        "1" : {
            "description": "Eine Java SDK für die Integration mit der Polar.sh API, die eine typsichere Anbindung an den Dienst ermöglicht. Die SDK nutzt moderne Java-Features und bietet eine benutzerfreundliche Schnittstelle und stammt nicht offiziell von polar.sh"
        },
        "2": {
            "description": "Das Portfolio zeigt meinen Werdegang und meine Arbeit als Fullstack-Softwareentwickler und hebt meine praktischen Erfahrungen mit modernen Webtechnologien hervor."
        },
        "3": {
            "description": "Dies ist die erste Version meines persönlichen Portfolios. Es enthält Informationen über mich, meinen Werdegang und meinen Tech Stack."
        },
        "4": {
            "description": "Dieses Projekt ist während meines Praktikums entstanden. Es war auch meine erste echte Berührung mit Next.js"
        }
    },
    "imprint": {
        "title": "Impressum",
        "name": "Joel Tobaben",
        "emailLabel": "E-Mail",
        "disclaimer": "Dies ist eine private Webseite zur Präsentation persönlicher Projekte und Arbeiten. Sie dient ausschließlich der nicht-kommerziellen Selbstdarstellung.",
        "additionalInfo": "Weitere Informationen gemäß § 5 DDG (Digitale-Dienste-Gesetz) sowie vollständige Kontaktdaten werden auf Anfrage bei berechtigtem Interesse bereitgestellt. Bitte wenden Sie sich dazu per E-Mail an die oben genannte Adresse."
    },
    "privacy-policy": {
        "title": "Datenschutzerklärung",
        "intro": "Diese Datenschutzerklärung informiert Sie über Art, Umfang und Zweck der Erhebung und Verwendung personenbezogener Daten auf dieser Website.",
        "responsible": {
            "title": "Verantwortliche Stelle",
            "text": "Verantwortlich im Sinne der DSGVO ist:",
            "emailLabel": "E-Mail"
        },
        "dataAccess": {
            "title": "Zugriffsdaten",
            "text": "Beim Besuch dieser Website werden automatisch Informationen über Zugriffe auf den Server gespeichert (z. B. IP-Adresse, Browsertyp, Datum und Uhrzeit). Diese Daten sind technisch erforderlich, um die Website korrekt darzustellen und die Sicherheit zu gewährleisten. Eine Zusammenführung mit anderen Datenquellen erfolgt nicht."
        },
        "contact": {
            "title": "Kontaktaufnahme",
            "text": "Wenn Sie mich per E-Mail kontaktieren, werden Ihre übermittelten Daten (z. B. E-Mail-Adresse, Nachricht) zwecks Bearbeitung der Anfrage gespeichert. Eine Weitergabe erfolgt nicht ohne Ihre Einwilligung."
        },
        "analytics": {
            "title": "Statistische Auswertungen",
            "text": "Diese Website kann zur Verbesserung des Angebots anonymisierte Nutzungsdaten erheben. Dabei werden keine personenbezogenen Profile erstellt und keine Cookies eingesetzt. Die Auswertung erfolgt ausschließlich auf aggregierter Basis."
        },
        "hosting": {
            "title": "Hosting der Website",
            "text": "Diese Website wird bei einem externen Dienstleister (Webhosting-Anbieter) betrieben. Alle Serverdaten (z. B. Zugriffsdaten, IP-Adressen) werden dort verarbeitet, um einen zuverlässigen und sicheren Betrieb sicherzustellen."
        },
        "rights": {
            "title": "Ihre Rechte",
            "text": "Sie haben das Recht auf Auskunft über die bei uns gespeicherten personenbezogenen Daten sowie auf Berichtigung, Löschung oder Einschränkung der Verarbeitung. Bitte wenden Sie sich dafür an die oben angegebene E-Mail-Adresse."
        },
        "legalBasis": {
            "title": "Rechtsgrundlage",
            "text": "Die Verarbeitung erfolgt gemäß Art. 6 Abs. 1 lit. f DSGVO auf Grundlage unseres berechtigten Interesses an einem sicheren, stabilen und optimierten Webangebot."
        },
        "lastUpdated": "Letzte Aktualisierung: 19. Juni 2025"
    }
}