{
    "navItems": {
        "workexperience": "Work Experience",
        "projects": "Projects"
    },
    "profile": {
        "introduction": {
            "firstLine": "Hi, I'm Joel.",
            "secondLine": "I'm a Fullstack",
            "thirdLine": "Software Engineer."
        },
        "badges": {
            "location": "Görlitz, Saxony, Germany",
            "age": "Years",
            "languages": {
                "de": "German (native)",
                "en": "English (fluent)"
            }
        },
        "techstack": {
            "java": "Programming Language",
            "mongodb": "Database",
            "docker": "Containerization",
            "git": "Version Control",
            "typescript": "Programming Language",
            "react": "Javascript Library"
        }
    },
    "discord": {
        "activity": {
            "since": "since"
        }
    },
    "workexperience": {
        "title": "Work Experience",
        "badge": {
            "current": "Current"
        },
        "3": {
            "title": "Digital Marketing Intern",
            "location": "Görlitz, Saxony, Germany",
            "startDate": "August 25, 2025",
            "endDate": "Today",
            "description": "LiberTec is a full-service online marketing agency that supports businesses with ads, content, web development, and design. During my internship, I work in various areas, including video editing, animations, ads, and design creation. This gives me a solid insight into the diverse tasks of a marketing agency."
        },
        "2": {
            "title": "Software development internship",
            "location": "Görlitz, Saxony, Germany",
            "startDate": "March 11, 2024",
            "endDate": "March 22, 2024",
            "description": "Development of a prototype web application with React, Next.js, and Tailwind. Implementation of a showcase for a shift register using the Calliope Mini. Backend development in Java with Javalin. Solid understanding of serial to parallel data conversion using the \"74HC595\" shift register."
        },
        "1": {
            "title": "Software development internship",
            "location": "Görlitz, Saxony, Germany",
            "startDate": "June 12, 2023",
            "endDate": "June 16, 2023",
            "description": "Development of a GTA for the Calliope Mini using JavaScript following code style guidelines. Creation of a project brief and evaluation of a REST API in Kotlin.",
            "codeStyle": "Codestyle"
        }
    },
    "projects": {
        "title": "Projects",
        "2": {
            "description": "This portfolio presents my journey and work as a fullstack software engineer, featuring hands-on experience with modern web technologies."
        },
        "1": {
            "description": "This is the first version of my personal portfolio. It includes information about me, my journey, and my techstack."
        },
        "0": {
            "description": "This project was created during my internship. It also was my first real touch with Next.js"
        }
    },
    "imprint": {
        "title": "Imprint",
        "name": "Joel Tobaben",
        "emailLabel": "Email",
        "disclaimer": "This is a private website used to present personal projects and work. It is intended solely for non-commercial self-presentation purposes.",
        "additionalInfo": "Further information in accordance with § 5 DDG (Digital Services Act, Germany) and complete contact details will be provided upon request if a legitimate interest is demonstrated. Please contact the email address above for such inquiries."
    },
    "privacy-policy": {
        "title": "Privacy Policy",
        "intro": "This privacy policy informs you about the type, scope, and purpose of the collection and use of personal data on this website.",
        "responsible": {
            "title": "Controller",
            "text": "The controller within the meaning of the GDPR is:",
            "emailLabel": "Email"
        },
        "dataAccess": {
            "title": "Access Data",
            "text": "When you visit this website, information about accesses to the server (e.g. IP address, browser type, date and time) is automatically stored. This data is technically necessary to display the website correctly and to ensure its security. This data is not merged with other data sources."
        },
        "contact": {
            "title": "Contact",
            "text": "If you contact me via email, your transmitted data (e.g. email address, message content) will be stored for the purpose of processing the request. This data will not be shared without your consent."
        },
        "analytics": {
            "title": "Analytics (Bklit Analytics)",
            "text": "This website uses Bklit Analytics for statistical evaluation of visitor behavior. Bklit stores a unique session identifier in the browser (localStorage) and transmits technical usage data to the analytics server, including the pages visited, time of access, referrer, browser information, marketing parameters (UTM tags), and a pseudonymous session ID. Additionally, your IP address is transmitted with each request and may be processed in pseudonymized or anonymized form. The tracking script is only activated after you have given your explicit consent in the cookie banner in accordance with Article 6(1)(a) GDPR and §25 TTDSG. You can revoke your consent at any time in the cookie settings."
        },
        "hosting": {
            "title": "Website Hosting",
            "text": "This website is hosted by an external service provider (web hosting provider). All server-related data (such as access logs and IP addresses) are processed there to ensure a reliable and secure operation."
        },
        "rights": {
            "title": "Your Rights",
            "text": "You have the right to obtain information about the personal data we store, as well as the right to correction, deletion, or restriction of processing. Please contact the email address mentioned above."
        },
        "legalBasis": {
            "title": "Legal Basis",
            "text": "Data processing is carried out in accordance with Article 6(1)(f) GDPR based on our legitimate interest in a secure, stable, and optimized website."
        },
        "lastUpdated": "Last updated: December 12, 2025"
    }
}